export default {
    "semi": false, // Добавлять точку с запятой в конце выражений (true по умолчанию)
    "singleQuote": false, // Использовать одинарные кавычки вместо двойных (false = двойные кавычки)
    "tabWidth": 4, // Размер табуляции (2 пробела — стандарт для многих проектов)
    "useTabs": true, // Использовать табуляцию вместо пробелов (false = пробелы)
    "trailingComma": "es5", // Добавлять запятые в конце многострочных объектов/массивов (es5 = только в массивах/объектах)
    "printWidth": 50, // Максимальная ширина строки (80 символов — стандарт, но можно увеличить до 100 или 120)
    "bracketSpacing": true, // Добавлять пробелы внутри фигурных скобок (true = "{ привет }")
    "arrowParens": "always", // Всегда использовать скобки для стрелочных функций (always = "(x) => {}")
    "endOfLine": "lf", // Конец строки (lf = Unix-style, auto = зависит от ОС)
    "jsxSingleQuote": false, // Использовать одинарные кавычки в JSX (false = двойные кавычки)
    "quoteProps": "as-needed", // Когда добавлять кавычки к свойствам объектов (as-needed = только если необходимо)
    "proseWrap": "preserve", // Как обрабатывать длинные строки в Markdown (preserve = сохранять исходное форматирование)
    "jsxBracketSameLine": false // Закрывающая скобка на новой строке
}
